"""
Дан массив: 1, 2, 3, 4, 5. Инвертировать порядок элементов в массиве
"""

arr = [1, 2, 3, 4, 5]
arr.reverse()
print(arr)
