"""
Дан список строк "apple", "orange", "banana", "pineapple", "grape". Отсортировать
его в порядке, обратном алфавитному.
"""

arr = ["apple", "orange", "banana", "pineapple", "grape"]
arr.sort()
arr.reverse()
print(arr)
